In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('educ_inc.csv')
df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,00 to 17,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,00 to 17,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,65 to 80+,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,65 to 80+,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,00 to 17,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,18 to 64,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,18 to 64,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,18 to 64,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

# First Question

###  1. Group the table by Educational Attainment and sum the Population Count in each category(2).

In [4]:
df.groupby(by = 'Educational Attainment').sum()

/var/folders/21/yhy2dhmx219b7cbcq243hmwc0000gn/T/ipykernel_31663/3077933478.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(by = 'Educational Attainment').sum()

                                Population Count
Educational Attainment
Bachelor's degree or higher             54617676
College, less than 4-yr degree          52137494
High school or equivalent               42942926
No high school diploma                  40668871

### 2. Analyse the percentage distribution of educational attainment among adult Californians(2).

In [6]:
df['Age'].value_counts()

18 to 64     448
65 to 80+    444
00 to 17     134
Name: Age, dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Age'] = le.fit_transform(df['Age'])
df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,0,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,0,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,2,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,2,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,0,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,1,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,1,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,1,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,1,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,1,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

In [9]:
df_adult = df[df['Age']>=1]

In [10]:
df_adult

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
2,1/1/08 0:00,2,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,2,Female,No high school diploma,"H: 75,000 and over",1981
9,1/1/08 0:00,1,Female,No high school diploma,"H: 75,000 and over",4233
11,1/1/08 0:00,2,Male,No high school diploma,"H: 75,000 and over",5801
16,1/1/08 0:00,2,Female,No high school diploma,"F: 35,000 to 49,999",8109
...,...,...,...,...,...,...
1021,1/1/14 0:00,1,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,1,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,1,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,1,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,1,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

In [16]:
obj = pd.DataFrame(df_adult.groupby('Educational Attainment')['Population Count'].sum())

In [18]:
obj

                                Population Count
Educational Attainment
Bachelor's degree or higher             54603003
College, less than 4-yr degree          52045952
High school or equivalent               42828045
No high school diploma                  31102348

In [20]:
s = obj['Population Count'].sum()
print(s)
obj['Percentage Distribution']= obj['Population Count']/s

180579348

In [21]:
obj

                                Population Count  Percentage Distribution
Educational Attainment
Bachelor's degree or higher             54603003                 0.302377
College, less than 4-yr degree          52045952                 0.288217
High school or equivalent               42828045                 0.237170
No high school diploma                  31102348                 0.172236

In [22]:
obj['Percentage Distribution']

Educational Attainment
Bachelor's degree or higher       0.302377
College, less than 4-yr degree    0.288217
High school or equivalent         0.237170
No high school diploma            0.172236
Name: Percentage Distribution, dtype: float64

### 3. Using pivot , get a contingency table (a table of counts) of adult Californians cross-classified by Educational Attainment and Personal Income(2).

# Second Question

### 4.List those NBA players who earned more than 10m USD(2).

In [24]:
nba_df = pd.read_csv('nba_salaries.csv')

In [25]:
nba_df

              PLAYER POSITION                TEAM     SALARY
0       Paul Millsap       PF       Atlanta Hawks  18.671659
1         Al Horford        C       Atlanta Hawks  12.000000
2     Tiago Splitter        C       Atlanta Hawks   9.756250
3        Jeff Teague       PG       Atlanta Hawks   8.000000
4        Kyle Korver       SG       Atlanta Hawks   5.746479
..               ...      ...                 ...        ...
412        Gary Neal       PG  Washington Wizards   2.139000
413     DeJuan Blair        C  Washington Wizards   2.000000
414  Kelly Oubre Jr.       SF  Washington Wizards   1.920240
415   Garrett Temple       SG  Washington Wizards   1.100602
416     Jarell Eddie       SG  Washington Wizards   0.561716

[417 rows x 4 columns]

In [27]:
nba_df[nba_df['SALARY']>10]

             PLAYER POSITION                TEAM     SALARY
0      Paul Millsap       PF       Atlanta Hawks  18.671659
1        Al Horford        C       Atlanta Hawks  12.000000
29      Joe Johnson       SF       Brooklyn Nets  24.894863
30   Thaddeus Young       PF       Brooklyn Nets  11.235955
42     Al Jefferson        C   Charlotte Hornets  13.500000
..              ...      ...                 ...        ...
368   DeMar DeRozan       SG     Toronto Raptors  10.050000
383  Gordon Hayward       SF           Utah Jazz  15.409570
400       John Wall       PG  Washington Wizards  15.851950
401    Nene Hilario        C  Washington Wizards  13.000000
402   Marcin Gortat        C  Washington Wizards  11.217391

[69 rows x 4 columns]

In [30]:
nba_df[nba_df['SALARY']>10]['PLAYER']

0        Paul Millsap
1          Al Horford
29        Joe Johnson
30     Thaddeus Young
42       Al Jefferson
            ...
368     DeMar DeRozan
383    Gordon Hayward
400         John Wall
401      Nene Hilario
402     Marcin Gortat
Name: PLAYER, Length: 69, dtype: object

### 5.How much money did each team pay for its players' salaries(2)?

In [32]:
nba_df['TEAM'].value_counts()

Memphis Grizzlies         21
Charlotte Hornets         18
Washington Wizards        17
Utah Jazz                 17
Toronto Raptors           17
Phoenix Suns              17
Oklahoma City Thunder     16
New Orleans Pelicans      16
Boston Celtics            15
Portland Trail Blazers    14
Orlando Magic             14
Atlanta Hawks             14
Denver Nuggets            14
Golden State Warriors     14
Brooklyn Nets             13
San Antonio Spurs         13
Philadelphia 76ers        13
New York Knicks           13
Los Angeles Clippers      13
Minnesota Timberwolves    13
Milwaukee Bucks           13
Indiana Pacers            13
Houston Rockets           12
Chicago Bulls             12
Miami Heat                12
Los Angeles Lakers        11
Dallas Mavericks          11
Sacramento Kings          11
Detroit Pistons           10
Cleveland Cavaliers       10
Name: TEAM, dtype: int64

In [31]:
nba_df.groupby('TEAM').sum()

/var/folders/21/yhy2dhmx219b7cbcq243hmwc0000gn/T/ipykernel_31663/670969577.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  nba_df.groupby('TEAM').sum()

                            SALARY
TEAM
Atlanta Hawks            69.573103
Boston Celtics           50.285499
Brooklyn Nets            57.306976
Charlotte Hornets        84.102397
Chicago Bulls            78.820890
Cleveland Cavaliers     102.312412
Dallas Mavericks         65.762559
Denver Nuggets           62.429404
Detroit Pistons          42.211760
Golden State Warriors    94.085137
Houston Rockets          85.285837
Indiana Pacers           62.695023
Los Angeles Clippers     66.074113
Los Angeles Lakers       68.607944
Memphis Grizzlies        93.796439
Miami Heat               81.528667
Milwaukee Bucks          52.258355
Minnesota Timberwolves   65.847421
New Orleans Pelicans     80.514606
New York Knicks          69.404994
Oklahoma City Thunder    96.832165
Orlando Magic            77.623940
Philadelphia 76ers       42.481345
Phoenix Suns             50.520815
Portland Trail Blazers   45.446878
Sacramento Kings         68.384890
San Antonio Spurs        84.652074
Toronto Raptors          74.672620
Utah Jazz                52.631878
Washington Wizards       90.047498

# Third Question

### 6.	Locate the first tuple corresponding to the last 3 digits of your Roll No, and check if the income is above 50K(1)